RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Include/hc32f472.h
typedef struct {
    stc_vref_bgrcr_bit_t                     BGRCR_b;
    stc_vref_cscr_bit_t                      CSCR_b;
    stc_vref_cr_bit_t                        CR_b;
} bCM_VREF_TypeDef;

typedef struct {
    stc_wdt_cr_bit_t                         CR_b;
    stc_wdt_sr_bit_t                         SR_b;
} bCM_WDT_TypeDef;


/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/
#define bCM_ADC1                             ((bCM_ADC_TypeDef *)0x42800000UL)
#define bCM_ADC2                             ((bCM_ADC_TypeDef *)0x42808000UL)
#define bCM_ADC3                             ((bCM_ADC_TypeDef *)0x42810000UL)
#define bCM_AES                              ((bCM_AES_TypeDef *)0x42100000UL)
#define bCM_AOS                              ((bCM_AOS_TypeDef *)0x42210000UL)
#define bCM_CAN1                             ((bCM_CAN_TypeDef *)0x42F00000UL)
#define bCM_CAN2                             ((bCM_CAN_TypeDef *)0x42E28000UL)
#define bCM_CAN3                             ((bCM_CAN_TypeDef *)0x42E20000UL)
#define bCM_CMP1                             ((bCM_CMP_TypeDef *)0x42708000UL)
#define bCM_CMP2                             ((bCM_CMP_TypeDef *)0x4270A000UL)
#define bCM_CMP3                             ((bCM_CMP_TypeDef *)0x42760000UL)
#define bCM_CMP4                             ((bCM_CMP_TypeDef *)0x42762000UL)
#define bCM_CMU                              ((bCM_CMU_TypeDef *)0x42900000UL)
#define bCM_CRC                              ((bCM_CRC_TypeDef *)0x42118000UL)
#define bCM_CTC                              ((bCM_CTC_TypeDef *)0x42938000UL)
#define bCM_DAC1                             ((bCM_DAC_TypeDef *)0x42820000UL)
#define bCM_DAC2                             ((bCM_DAC_TypeDef *)0x42828000UL)
#define bCM_DAC3                             ((bCM_DAC_TypeDef *)0x42830000UL)
#define bCM_DAC4                             ((bCM_DAC_TypeDef *)0x42838000UL)
#define bCM_DCU1                             ((bCM_DCU_TypeDef *)0x42AC0000UL)
#define bCM_DCU2                             ((bCM_DCU_TypeDef *)0x42AC8000UL)
#define bCM_DCU3                             ((bCM_DCU_TypeDef *)0x42AD0000UL)
#define bCM_DMA1                             ((bCM_DMA_TypeDef *)0x42A60000UL)
#define bCM_DMA2                             ((bCM_DMA_TypeDef *)0x42A68000UL)
#define bCM_EFM                              ((bCM_EFM_TypeDef *)0x42208000UL)
#define bCM_EMB0                             ((bCM_EMB_TypeDef *)0x422F8000UL)
#define bCM_EMB1                             ((bCM_EMB_TypeDef *)0x422F8400UL)
#define bCM_EMB2                             ((bCM_EMB_TypeDef *)0x422F8800UL)
#define bCM_EMB3                             ((bCM_EMB_TypeDef *)0x422F8C00UL)
#define bCM_EMB4                             ((bCM_EMB_TypeDef *)0x422F9000UL)
#define bCM_EMB5                             ((bCM_EMB_TypeDef *)0x422F9400UL)
#define bCM_EMB6                             ((bCM_EMB_TypeDef *)0x422F9800UL)
#define bCM_FCM                              ((bCM_FCM_TypeDef *)0x42908000UL)
#define bCM_FMAC1                            ((bCM_FMAC_TypeDef *)0x42B00000UL)
#define bCM_FMAC2                            ((bCM_FMAC_TypeDef *)0x42B08000UL)
#define bCM_FMAC3                            ((bCM_FMAC_TypeDef *)0x42B10000UL)
#define bCM_FMAC4                            ((bCM_FMAC_TypeDef *)0x42B18000UL)
#define bCM_GPIO                             ((bCM_GPIO_TypeDef *)0x42A70000UL)
#define bCM_HASH                             ((bCM_HASH_TypeDef *)0x42108000UL)
#define bCM_I2C1                             ((bCM_I2C_TypeDef *)0x42768000UL)
#define bCM_I2C2                             ((bCM_I2C_TypeDef *)0x42770000UL)
#define bCM_I2C3                             ((bCM_I2C_TypeDef *)0x42778000UL)
#define bCM_INTC                             ((bCM_INTC_TypeDef *)0x42A20000UL)
#define bCM_KEYSCAN                          ((bCM_KEYSCAN_TypeDef *)0x42A18000UL)
#define bCM_MAU                              ((bCM_MAU_TypeDef *)0x42AA0000UL)
#define bCM_MDIO                             ((bCM_MDIO_TypeDef *)0x42508000UL)
#define bCM_MPU                              ((bCM_MPU_TypeDef *)0x42A00000UL)
#define bCM_OTS                              ((bCM_OTS_TypeDef *)0x4220C000UL)
#define bCM_PERIC                            ((bCM_PERIC_TypeDef *)0x42AA8000UL)
#define bCM_PLA                              ((bCM_PLA_TypeDef *)0x429F8000UL)
#define bCM_PWC                              ((bCM_PWC_TypeDef *)0x42900000UL)
#define bCM_RMU                              ((bCM_RMU_TypeDef *)0x42999C00UL)
#define bCM_RTC                              ((bCM_RTC_TypeDef *)0x42980000UL)
#define bCM_SPI1                             ((bCM_SPI_TypeDef *)0x42380000UL)
#define bCM_SPI2                             ((bCM_SPI_TypeDef *)0x42388000UL)
#define bCM_SPI3                             ((bCM_SPI_TypeDef *)0x42400000UL)
#define bCM_SPI4                             ((bCM_SPI_TypeDef *)0x42408000UL)
#define bCM_SRAMC                            ((bCM_SRAMC_TypeDef *)0x42A10000UL)
#define bCM_SWDT                             ((bCM_SWDT_TypeDef *)0x42928000UL)
#define bCM_TMR0_1                           ((bCM_TMR0_TypeDef *)0x42480000UL)
#define bCM_TMR0_2                           ((bCM_TMR0_TypeDef *)0x42488000UL)
#define bCM_TMR2_1                           ((bCM_TMR2_TypeDef *)0x42490000UL)
#define bCM_TMR2_2                           ((bCM_TMR2_TypeDef *)0x42498000UL)
#define bCM_TMR2_3                           ((bCM_TMR2_TypeDef *)0x424A0000UL)
#define bCM_TMR2_4                           ((bCM_TMR2_TypeDef *)0x424A8000UL)
#define bCM_TMR4                             ((bCM_TMR4_TypeDef *)0x42700000UL)
#define bCM_TMR6_1                           ((bCM_TMR6_TypeDef *)0x42780000UL)
#define bCM_TMR6_10                          ((bCM_TMR6_TypeDef *)0x427C8000UL)
#define bCM_TMR6_2                           ((bCM_TMR6_TypeDef *)0x42788000UL)
#define bCM_TMR6_3                           ((bCM_TMR6_TypeDef *)0x42790000UL)
#define bCM_TMR6_4                           ((bCM_TMR6_TypeDef *)0x42798000UL)
#define bCM_TMR6_5                           ((bCM_TMR6_TypeDef *)0x427A0000UL)
#define bCM_TMR6_6                           ((bCM_TMR6_TypeDef *)0x427A8000UL)
#define bCM_TMR6_7                           ((bCM_TMR6_TypeDef *)0x427B0000UL)
#define bCM_TMR6_8                           ((bCM_TMR6_TypeDef *)0x427B8000UL)
#define bCM_TMR6_9                           ((bCM_TMR6_TypeDef *)0x427C0000UL)
#define bCM_TMR6_COMMON                      ((bCM_TMR6_COMMON_TypeDef *)0x42786000UL)
#define bCM_TMRA_1                           ((bCM_TMRA_TypeDef *)0x42740000UL)
#define bCM_TMRA_2                           ((bCM_TMRA_TypeDef *)0x42748000UL)
#define bCM_TMRA_3                           ((bCM_TMRA_TypeDef *)0x42750000UL)
#define bCM_TMRA_4                           ((bCM_TMRA_TypeDef *)0x42758000UL)
#define bCM_TMRA_5                           ((bCM_TMRA_TypeDef *)0x424C0000UL)
#define bCM_TMRA_6                           ((bCM_TMRA_TypeDef *)0x424C8000UL)
#define bCM_TRNG                             ((bCM_TRNG_TypeDef *)0x42840000UL)
#define bCM_USART1                           ((bCM_USART_TypeDef *)0x42398000UL)
#define bCM_USART2                           ((bCM_USART_TypeDef *)0x423A0000UL)
#define bCM_USART3                           ((bCM_USART_TypeDef *)0x423A8000UL)
#define bCM_USART4                           ((bCM_USART_TypeDef *)0x42418000UL)
#define bCM_USART5                           ((bCM_USART_TypeDef *)0x42420000UL)
#define bCM_USART6                           ((bCM_USART_TypeDef *)0x42428000UL)
#define bCM_USBFS                            ((bCM_USBFS_TypeDef *)0x43000000UL)
#define bCM_VREF                             ((bCM_VREF_TypeDef *)0x429F0000UL)
#define bCM_WDT                              ((bCM_WDT_TypeDef *)0x42920000UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32F472_H__ */
